Tianhyang/STM32_Framework/rtos/freertos/config/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include <stdint.h>

#include "stm32f1xx.h"

#define configUSE_PREEMPTION                       1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION   1
#define configUSE_TIME_SLICING                    1
#define configUSE_IDLE_HOOK                       0
#define configUSE_TICK_HOOK                       0
#define configCPU_CLOCK_HZ                        ( SystemCoreClock )
#define configTICK_RATE_HZ                        ( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES                      8
#define configMINIMAL_STACK_SIZE                  128
#define configTOTAL_HEAP_SIZE                     ( ( size_t ) ( 12 * 1024 ) )
#define configMAX_TASK_NAME_LEN                   16
#define configTICK_TYPE_WIDTH_IN_BITS             TICK_TYPE_WIDTH_32_BITS
#define configIDLE_SHOULD_YIELD                   1
#define configUSE_MUTEXES                         1
#define configUSE_TIMERS                          1
#define configUSE_RECURSIVE_MUTEXES               0
#define configUSE_COUNTING_SEMAPHORES             0
#define configQUEUE_REGISTRY_SIZE                 0
#define configUSE_QUEUE_SETS                      0
#define configUSE_NEWLIB_REENTRANT                0
#define configENABLE_BACKWARD_COMPATIBILITY       0
#define configNUM_THREAD_LOCAL_STORAGE_POINTERS   0
#define configUSE_TASK_NOTIFICATIONS              1
#define configTASK_NOTIFICATION_ARRAY_ENTRIES     1
#define configSTACK_DEPTH_TYPE                    uint16_t
#define configMESSAGE_BUFFER_LENGTH_TYPE          size_t
#define configTIMER_TASK_PRIORITY                 ( tskIDLE_PRIORITY + 2 )
#define configTIMER_QUEUE_LENGTH                  8
#define configTIMER_TASK_STACK_DEPTH              256

#define configSUPPORT_DYNAMIC_ALLOCATION          1
#define configSUPPORT_STATIC_ALLOCATION           0
#define configKERNEL_PROVIDED_STATIC_MEMORY       0

#define configUSE_MALLOC_FAILED_HOOK              1
#define configCHECK_FOR_STACK_OVERFLOW            2

#define configPRIO_BITS                           4
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY   15
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5

#define configKERNEL_INTERRUPT_PRIORITY           ( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )
#define configMAX_SYSCALL_INTERRUPT_PRIORITY      ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << ( 8 - configPRIO_BITS ) )

#define configCHECK_HANDLER_INSTALLATION          1

#define vPortSVCHandler                           SVC_Handler
#define xPortPendSVHandler                        PendSV_Handler

#define INCLUDE_vTaskPrioritySet                  0
#define INCLUDE_uxTaskPriorityGet                 0
#define INCLUDE_vTaskDelete                       1
#define INCLUDE_vTaskSuspend                      0
#define INCLUDE_xResumeFromISR                    0
#define INCLUDE_vTaskDelayUntil                   0
#define INCLUDE_vTaskDelay                        1
#define INCLUDE_xTaskGetSchedulerState            1
#define INCLUDE_xTaskAbortDelay                   0
#define INCLUDE_xTaskGetHandle                    0
#define INCLUDE_xTaskResumeFromISR                0
#define INCLUDE_eTaskGetState                     0
#define INCLUDE_xTimerPendFunctionCall            1
#define INCLUDE_xTaskGetIdleTaskHandle            0
#define INCLUDE_uxTaskGetStackHighWaterMark       1

#define configASSERT(x)                           do { if ((x) == 0) { __disable_irq(); for (;;) {} } } while (0)

#endif
